###################################################################

# Created by write_sdc on Sat Feb 20 19:02:05 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
set_driving_cell -lib_cell INVX1 -library saed90nm_typ_ht [get_ports start]
set_driving_cell -lib_cell INVX1 -library saed90nm_typ_ht [get_ports clk]
set_driving_cell -lib_cell INVX1 -library saed90nm_typ_ht [get_ports clear]
set_driving_cell -lib_cell INVX1 -library saed90nm_typ_ht [get_ports {num[6]}]
set_driving_cell -lib_cell INVX1 -library saed90nm_typ_ht [get_ports {num[5]}]
set_driving_cell -lib_cell INVX1 -library saed90nm_typ_ht [get_ports {num[4]}]
set_driving_cell -lib_cell INVX1 -library saed90nm_typ_ht [get_ports {num[3]}]
set_driving_cell -lib_cell INVX1 -library saed90nm_typ_ht [get_ports {num[2]}]
set_driving_cell -lib_cell INVX1 -library saed90nm_typ_ht [get_ports {num[1]}]
set_driving_cell -lib_cell INVX1 -library saed90nm_typ_ht [get_ports {num[0]}]
set_fanout_load 8 [get_ports {result[3]}]
set_fanout_load 8 [get_ports {result[2]}]
set_fanout_load 8 [get_ports {result[1]}]
set_fanout_load 8 [get_ports {result[0]}]
set_fanout_load 8 [get_ports ready]
set_load -pin_load 0.1 [get_ports {result[3]}]
set_load -pin_load 0.1 [get_ports {result[2]}]
set_load -pin_load 0.1 [get_ports {result[1]}]
set_load -pin_load 0.1 [get_ports {result[0]}]
set_load -pin_load 0.1 [get_ports ready]
set_max_fanout 1 [get_ports start]
set_max_fanout 1 [get_ports clk]
set_max_fanout 1 [get_ports clear]
set_max_fanout 1 [get_ports {num[6]}]
set_max_fanout 1 [get_ports {num[5]}]
set_max_fanout 1 [get_ports {num[4]}]
set_max_fanout 1 [get_ports {num[3]}]
set_max_fanout 1 [get_ports {num[2]}]
set_max_fanout 1 [get_ports {num[1]}]
set_max_fanout 1 [get_ports {num[0]}]
create_clock [get_ports clk]  -period 100  -waveform {0 50}
set_clock_latency 0.3  [get_clocks clk]
set_input_delay -clock clk  2  [get_ports clk]
set_input_delay -clock clk  2  [get_ports start]
set_input_delay -clock clk  2  [get_ports clear]
set_input_delay -clock clk  2  [get_ports {num[6]}]
set_input_delay -clock clk  2  [get_ports {num[5]}]
set_input_delay -clock clk  2  [get_ports {num[4]}]
set_input_delay -clock clk  2  [get_ports {num[3]}]
set_input_delay -clock clk  2  [get_ports {num[2]}]
set_input_delay -clock clk  2  [get_ports {num[1]}]
set_input_delay -clock clk  2  [get_ports {num[0]}]
set_output_delay -clock clk  1.65  [get_ports {result[3]}]
set_output_delay -clock clk  1.65  [get_ports {result[2]}]
set_output_delay -clock clk  1.65  [get_ports {result[1]}]
set_output_delay -clock clk  1.65  [get_ports {result[0]}]
set_output_delay -clock clk  1.65  [get_ports ready]
set_drive 0.5  [get_ports test_si]
set_drive 0.5  [get_ports test_se]
